load-testing-results/ab results/results.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        1756 bytes

Concurrency Level:      1000
Time taken for tests:   1235.633 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      2102000000 bytes
HTML transferred:       1756000000 bytes
Requests per second:    809.30 [#/sec] (mean)
Time per request:       1235.633 [ms] (mean)
Time per request:       1.236 [ms] (mean, across all concurrent requests)
Transfer rate:          1661.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  23.3      0     526
Processing:    43 1232 138.4   1200    1750
Waiting:        0  994 282.5   1143    1627
Total:         43 1233 139.5   1200    1750

Percentage of the requests served within a certain time (ms)
  50%   1200
  66%   1204
  75%   1208
  80%   1211
  90%   1221
  95%   1697
  98%   1712
  99%   1720
 100%   1750 (longest request)